src/cf/Documents/уатОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОприходованиеТоваров</Name>
			<Comment>Оприходование материалов (уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатИнвентаризацияТоваров</xr:Item>
				<xr:Item>Document.уатСписаниеАгрегатов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатСпецодеждаИИнструментыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатСписаниеАгрегатов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>(Общ) Основание (статья) оприходования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатСпецодеждаИИнструментыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатСпецодеждаИИнструментыСотрудников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Первоначальная стоимость в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИзноса</Name>
					<Comment>Сумма износа в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатПартииТоваровНаСкладах</Name>
			<Comment>Партии товаров на складах  (уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость в валюте регламентированного учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Comment>Стоимость в валюте управленческого учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОперацииСТехническимиЖидкостями</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСливГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/СпособыОценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОценки</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
					<Comment>First input, first output (первым пришел, первым обработан)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
					<Comment>Last input, first output (последним пришел, первым обработан)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатОприходованиеТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатОприходованиеТоваров";
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("en='Taking goods on charge';ru='Оприходование товаров'");
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Register of documents ""Taking goods on charge""';ru='Реестр документов ""Оприходование товаров""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная",
			"Оприходование товаров", ПечатьНакладная(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	УчетнаяПолитика          = уатОбщегоНазначения.УчетнаяПолитика(ДокументСсылка.Организация, ДокументСсылка.Дата);
	СпособСписанияПартий     = УчетнаяПолитика.СпособОценкиМПЗ;
	УчетПартийПоОрганизациям = УчетнаяПолитика.УчетПартийПоОрганизациям;
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	уатОприходованиеТоваровТовары.Ссылка.Дата КАК Период,
	|	уатОприходованиеТоваровТовары.Ссылка КАК Регистратор,
	|	уатОприходованиеТоваровТовары.Ссылка.Склад КАК Склад,
	|	&Партия КАК Партия,
	|	уатОприходованиеТоваровТовары.Номенклатура,
	|	уатОприходованиеТоваровТовары.ЕдиницаИзмерения,
	|	уатОприходованиеТоваровТовары.Количество * ЕСТЬNULL(уатОприходованиеТоваровТовары.ЕдиницаИзмерения.Коэффициент, 1) / уатОприходованиеТоваровТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Количество,
	|	уатОприходованиеТоваровТовары.Цена,
	|	уатОприходованиеТоваровТовары.Сумма
	|ПОМЕСТИТЬ ТаблицаДокументаТовары
	|ИЗ
	|	Документ.уатОприходованиеТоваров.Товары КАК уатОприходованиеТоваровТовары
	|ГДЕ
	|	уатОприходованиеТоваровТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокументаТовары.Склад,
	|	ТаблицаДокументаТовары.Партия,
	|	ТаблицаДокументаТовары.Номенклатура
	|ИЗ
	|	ТаблицаДокументаТовары КАК ТаблицаДокументаТовары";
	
	Если СпособСписанияПартий <> Перечисления.СпособыОценки.ПоСредней Тогда
		мЗапрос.УстановитьПараметр("Партия", ДокументСсылка);
	Иначе
		мЗапрос.УстановитьПараметр("Партия", Неопределено);
	КонецЕсли;
	
	МассивРезультатов = мЗапрос.ВыполнитьПакет();
	
	мЗапрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.ВидДвижения,
	|	Товары.Период,
	|	Товары.Регистратор,
	|	Товары.Склад,
	|	Товары.Партия,
	|	Товары.Номенклатура,
	|	Товары.Количество,
	|	Товары.Сумма КАК Стоимость,
	|	Товары.Сумма КАК СтоимостьУпр
	|ИЗ
	|	ТаблицаДокументаТовары КАК Товары";
	
	Выборка = мЗапрос.Выполнить();
	ТаблицаПартии = Выборка.Выгрузить();
	
	Если УчетПартийПоОрганизациям Тогда
		ТаблицаПартии.Колонки.Добавить("Организация");
	КонецЕсли;

	ВалютаРеглОбщая = Константы.ВалютаРегламентированногоУчета.Получить();
	СтруктураКурсаВалютаРеглОбщая = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаРеглОбщая,
		СтруктураДополнительныеСвойства.ДатаКурса, ДокументСсылка);
		
	Для Каждого ТекСтрока ИЗ ТаблицаПартии Цикл
		Если СтруктураДополнительныеСвойства.Свойство("ВалютаУпрУчета") Тогда 
			Если СтруктураДополнительныеСвойства.ВалютаУпрУчета <> ВалютаРеглОбщая Тогда 
				ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость,
					СтруктураДополнительныеСвойства.ВалютаУпрУчета, ВалютаРеглОбщая,
					СтруктураДополнительныеСвойства.КурсУпр, 		СтруктураКурсаВалютаРеглОбщая.Курс,
					СтруктураДополнительныеСвойства.КратностьУпр, 	СтруктураКурсаВалютаРеглОбщая.Кратность,,
					ДокументСсылка);
			КонецЕсли;
		Иначе
			ТекСтрока.СтоимостьУпр = 0;
		КонецЕсли;
		
		Если УчетПартийПоОрганизациям Тогда
			ТекСтрока.Организация = ДокументСсылка.Организация;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартии", ТаблицаПартии);
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД()
		И ПолучитьФункциональнуюОпцию("уатАдресноеХранение") = ИСТИНА
		И ДокументСсылка.Склад.АдресноеХранение Тогда
		
		ЗапросЯчейки = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	уатОприходованиеТоваровТовары.Ссылка.Дата КАК Период,
		|	уатОприходованиеТоваровТовары.Ссылка КАК Регистратор,
		|	уатОприходованиеТоваровТовары.Ссылка.Склад КАК Склад,
		|	уатОприходованиеТоваровТовары.Ссылка.Склад.ТранзитнаяЯчейка КАК Ячейка,
		|	уатОприходованиеТоваровТовары.Номенклатура КАК Номенклатура,
		|	уатОприходованиеТоваровТовары.Количество * ЕСТЬNULL(уатОприходованиеТоваровТовары.ЕдиницаИзмерения.Коэффициент, 1) / уатОприходованиеТоваровТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Количество
		|ИЗ
		|	Документ.уатОприходованиеТоваров.Товары КАК уатОприходованиеТоваровТовары
		|ГДЕ
		|	уатОприходованиеТоваровТовары.Ссылка = &Ссылка");
		ЗапросЯчейки.УстановитьПараметр("Ссылка", ДокументСсылка);
		тблТоварыВЯчейках = ЗапросЯчейки.Выполнить().Выгрузить(); 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТоварыВЯчейках", тблТоварыВЯчейках);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка.ВозвратОтСотрудника) Тогда
		СформироватьТаблицуСпецодеждаСотрудников(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСпецодеждаСотрудников(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Ссылка.ВозвратОтСотрудника КАК Сотрудник,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Количество * ЕСТЬNULL(ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент, 1) / ТаблицаДокумента.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Количество
	|ИЗ
	|	Документ.уатОприходованиеТоваров.Товары КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.СпецодеждаИИнструменты)";	
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатСпецодеждаИИнструментыСотрудников");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаДокумента;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник",    "Сотрудник");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	ТаблицаПартий = ПолучитьТаблицуСпецодеждыДляСписания(ТаблицаДокумента,
		СтруктураДополнительныеСвойства.ДляПроведения.МоментКонтроля,
		ДокументСсылка.ВозвратОтСотрудника);
	
	ЗапросПартии = Новый Запрос();
	ЗапросПартии.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабДанных.Номенклатура КАК Номенклатура,
	|	ТабДанных.ДатаВыдачи КАК ДатаВыдачи,
	|	ТабДанных.Сотрудник КАК Сотрудник,
	|	ТабДанных.Должность КАК Должность,
	|	ТабДанных.Количество КАК Количество,
	|	ТабДанных.Стоимость КАК Стоимость,
	|	ТабДанных.СуммаИзноса КАК СуммаИзноса
	|ПОМЕСТИТЬ ВремТаблицаПартий
	|ИЗ
	|	&ТаблицаПарам КАК ТабДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Регистратор КАК Регистратор,
	|	ТабДанных.Номенклатура КАК Номенклатура,
	|	ТабДанных.ДатаВыдачи КАК ДатаВыдачи,
	|	ТабДанных.Сотрудник КАК Сотрудник,
	|	ТабДанных.Должность КАК Должность,
	|	ТабДанных.Количество КАК Количество,
	|	ТабДанных.Стоимость КАК Стоимость,
	|	ТабДанных.СуммаИзноса КАК СуммаИзноса
	|ИЗ
	|	ВремТаблицаПартий КАК ТабДанных";
	
	ЗапросПартии.УстановитьПараметр("Период",       ДокументСсылка.Дата);
	ЗапросПартии.УстановитьПараметр("ТаблицаПарам", ТаблицаПартий);
	ЗапросПартии.УстановитьПараметр("Регистратор",  ДокументСсылка);

	ТаблицаСпецодеждаСотрудников = ЗапросПартии.Выполнить().Выгрузить();
			
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСпецодеждаСотрудников", ТаблицаСпецодеждаСотрудников);
	
КонецПроцедуры

// Функция возвращает таблицу спецодежды сотрудника для списания. Списание выполняется по ФИФО по датам выдачи спецодежды
//
// Параметры:
//  ТаблицаНоменклатуры - таблица номенклатуры для которой необходимо получить списываемые остатки спецодежды
// МоментВремени        - Момент времени на который получаются остатки
// ДопПараметры - структура с произвольными параметрами
//
// Возвращаемое значение:
//  Таблица списания спецодежды, колонки соответствуют полям регистра накопления уатСпецодеждаИИнструментыСотрудников
//
Функция ПолучитьТаблицуСпецодеждыДляСписания(ТаблицаНоменклатуры, МоментВремени, Сотрудник, ДопПараметры = Неопределено)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремТаб.Номенклатура,
	|	ВремТаб.Количество
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаПараметр КАК ВремТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНоменклатуры.Номенклатура,
	|	СУММА(ТаблицаНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаНоменклатурыГруппировка
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Спецодежда.Номенклатура КАК Номенклатура,
	|	Спецодежда.Количество КАК Количество,
	|	уатСпецодеждаИИнструментыСотрудниковОстатки.Сотрудник КАК Сотрудник,
	|	уатСпецодеждаИИнструментыСотрудниковОстатки.Должность КАК Должность,
	|	уатСпецодеждаИИнструментыСотрудниковОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ЕСТЬNULL(уатСпецодеждаИИнструментыСотрудниковОстатки.КоличествоОстаток, 0) КАК КоличествоПартия,
	|	ЕСТЬNULL(уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток,
	|	ЕСТЬNULL(уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток, 0) КАК СуммаИзносаОстаток,
	|	ЕСТЬNULL(уатСпецодеждаИИнструментыСотрудниковОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось
	|ИЗ
	|	ТаблицаНоменклатурыГруппировка КАК Спецодежда
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(
	|				&МоментВремени,
	|				Сотрудник = &Сотрудник
	|					И Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							мТаб.Номенклатура
	|						ИЗ
	|							ТаблицаНоменклатуры КАК мТаб)) КАК уатСпецодеждаИИнструментыСотрудниковОстатки
	|		ПО Спецодежда.Номенклатура = уатСпецодеждаИИнструментыСотрудниковОстатки.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатСпецодеждаИИнструментыСотрудниковОстатки.ДатаВыдачи";
	
	мЗапрос.УстановитьПараметр("Сотрудник", Сотрудник);
	мЗапрос.УстановитьПараметр("ТаблицаПараметр", ТаблицаНоменклатуры);
	Если МоментВремени = Неопределено Тогда 
		мЗапрос.УстановитьПараметр("МоментВремени", Дата('00010101'));
	Иначе
		мЗапрос.УстановитьПараметр("МоментВремени", МоментВремени);
	КонецЕсли;
		
	МассивРезультатов = мЗапрос.ВыполнитьПакет();
	
	ТаблицаОстатковПартий = МассивРезультатов[2].Выгрузить();
	ТаблицаПартий = Новый ТаблицаЗначений();
	ТаблицаПартий.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПартий.Колонки.Добавить("ДатаВыдачи",   Новый ОписаниеТипов("Дата"));
	ТаблицаПартий.Колонки.Добавить("Сотрудник",    Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПартий.Колонки.Добавить("Должность",    Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаПартий.Колонки.Добавить("Количество",   Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(15,3));
	ТаблицаПартий.Колонки.Добавить("Стоимость",    Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(15,2));
	ТаблицаПартий.Колонки.Добавить("СуммаИзноса",  Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(15,2));
		
	Для Каждого ТекСтрокаТабНоменклатуры Из ТаблицаНоменклатуры Цикл
		ОсталосьСписать = ТекСтрокаТабНоменклатуры.Количество;	
		Для каждого ТекСтрокаОстатковПартий Из ТаблицаОстатковПартий Цикл
			Если ОсталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если ТекСтрокаТабНоменклатуры.Номенклатура = ТекСтрокаОстатковПартий.Номенклатура
			    И ТекСтрокаОстатковПартий.КоличествоОсталось > 0 Тогда
				
				СписатьКоличество = Мин(ТекСтрокаОстатковПартий.КоличествоОсталось, ОсталосьСписать);
				Если СписатьКоличество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				НовСтрока = ТаблицаПартий.Добавить();
				НовСтрока.Номенклатура = ТекСтрокаОстатковПартий.Номенклатура;
				НовСтрока.ДатаВыдачи   = ТекСтрокаОстатковПартий.ДатаВыдачи;
				НовСтрока.Сотрудник    = ТекСтрокаОстатковПартий.Сотрудник;
				НовСтрока.Должность    = ТекСтрокаОстатковПартий.Должность;
				НовСтрока.Количество   = СписатьКоличество;
				Если СписатьКоличество = ТекСтрокаОстатковПартий.КоличествоОсталось Тогда
					НовСтрока.Стоимость = ТекСтрокаОстатковПартий.СтоимостьОстаток;
					НовСтрока.СуммаИзноса = ТекСтрокаОстатковПартий.СуммаИзносаОстаток;
				ИначеЕсли ТекСтрокаОстатковПартий.КоличествоОсталось <> 0 Тогда
					НовСтрока.Стоимость = Окр(ТекСтрокаОстатковПартий.СтоимостьОстаток / 
						ТекСтрокаОстатковПартий.КоличествоОсталось * СписатьКоличество, 2);
					НовСтрока.СуммаИзноса = Окр(ТекСтрокаОстатковПартий.СуммаИзносаОстаток / 
						ТекСтрокаОстатковПартий.КоличествоОсталось * СписатьКоличество, 2);
				КонецЕсли;
				ОсталосьСписать = ОсталосьСписать - СписатьКоличество;
				ТекСтрокаОстатковПартий.КоличествоОсталось  = ТекСтрокаОстатковПартий.КоличествоОсталось - СписатьКоличество;
				ТекСтрокаОстатковПартий.СтоимостьОстаток    = ТекСтрокаОстатковПартий.СтоимостьОстаток   - НовСтрока.Стоимость;
				ТекСтрокаОстатковПартий.СуммаИзносаОстаток  = ТекСтрокаОстатковПартий.СуммаИзносаОстаток - НовСтрока.СуммаИзноса;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОсталосьСписать > 0 тогда
			НовСтрока = ТаблицаПартий.Добавить();
			НовСтрока.Номенклатура = ТекСтрокаТабНоменклатуры.Номенклатура;
			НовСтрока.ДатаВыдачи   = '00010101';
			НовСтрока.Сотрудник    = Сотрудник;
			НовСтрока.Должность    = Неопределено;
			НовСтрока.Количество   = ОсталосьСписать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПартий;
	
КонецФункции

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);

	//материалы
	мЗапрос = Новый Запрос;
	мЗапрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц; 
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Оприходование.Номенклатура,
	|	Оприходование.Ссылка КАК Регистратор,
	|	уатПартииТоваровНаСкладахОстатки.КоличествоОстаток
	|ИЗ
	|	Документ.уатОприходованиеТоваров.Товары КАК Оприходование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатПартииТоваровНаСкладах.Остатки(
	|				&МоментВремени,
	|				Склад = &Склад
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							уатОприходованиеТоваровТовары.Номенклатура
	|						ИЗ
	|							Документ.уатОприходованиеТоваров.Товары КАК уатОприходованиеТоваровТовары
	|						ГДЕ
	|							уатОприходованиеТоваровТовары.Ссылка = &Ссылка)) КАК уатПартииТоваровНаСкладахОстатки
	|		ПО Оприходование.Ссылка.Склад = уатПартииТоваровНаСкладахОстатки.Склад
	|			И Оприходование.Номенклатура = уатПартииТоваровНаСкладахОстатки.Номенклатура
	|			И (&Партия = уатПартииТоваровНаСкладахОстатки.Партия)
	|ГДЕ
	|	Оприходование.Ссылка = &Ссылка
	|	И ЕСТЬNULL(уатПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) < 0";
	
	мЗапрос.УстановитьПараметр("Склад"        , ДокументСсылка.Склад);
	мЗапрос.УстановитьПараметр("Ссылка"       , ДокументСсылка);
	мЗапрос.УстановитьПараметр("МоментВремени", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
	
	УчетнаяПолитика = уатОбщегоНазначения.УчетнаяПолитика(ДокументСсылка.Организация, ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
	Если УчетнаяПолитика.СпособОценкиМПЗ <> Перечисления.СпособыОценки.ПоСредней Тогда
		мЗапрос.УстановитьПараметр("Партия", ДокументСсылка);
	Иначе
		мЗапрос.УстановитьПараметр("Партия", Неопределено);
	КонецЕсли;
	
	Выборка = мЗапрос.Выполнить().Выбрать();
	Если Выборка.Количество() тогда
		Пока Выборка.Следующий() Цикл
			#Если ТонкийКлиент тогда	
			#Иначе
				ТекстНСТР = НСтр("en='For ""%1"" received negative remains on warehouse""%2"". Remains on warehouse %3';ru='Для ""%1"" получены отрицательные остатки на складе ""%2"". Остаток на складе %3'");
				ТекстНСТР = СтрШаблон(ТекстНСТР, Выборка.Номенклатура, ДокументСсылка.Склад, Выборка.КоличествоОстаток);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			#КонецЕсли
		КонецЦикла;
	КонецЕсли;

	//спецодежда
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаДокумента.Количество * ЕСТЬNULL(ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент, 1) / ТаблицаДокумента.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК Количество
	|ПОМЕСТИТЬ вт_ТаблицаДокумента
	|ИЗ
	|	Документ.уатОприходованиеТоваров.Товары КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.СпецодеждаИИнструменты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ЕСТЬNULL(уатСпецодеждаИИнструментыСотрудниковОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	вт_ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(
	|				&МоментВремени,
	|				Сотрудник = &Сотрудник
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТабНоменклатуры.Номенклатура
	|						ИЗ
	|							вт_ТаблицаДокумента КАК ТабНоменклатуры)) КАК уатСпецодеждаИИнструментыСотрудниковОстатки
	|		ПО ТаблицаДокумента.Номенклатура = уатСпецодеждаИИнструментыСотрудниковОстатки.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(уатСпецодеждаИИнструментыСотрудниковОстатки.КоличествоОстаток, 0) < 0";
	мЗапрос.УстановитьПараметр("Ссылка"       , ДокументСсылка);
	мЗапрос.УстановитьПараметр("Сотрудник"    , ДокументСсылка.ВозвратОтСотрудника);
	мЗапрос.УстановитьПараметр("МоментВремени", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
	Выборка = мЗапрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстНСТР = НСтр("en='For ""%1"" the amount of return (%2) exceeds the employees balance (%3)';ru='Для ""%1"" количество возврата (%2) превышает остаток у сотрудника (%3)'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, Выборка.Номенклатура, Выборка.Количество, Выборка.КоличествоОстаток + Выборка.Количество);
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьКонтроль()

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//   Структура доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Склад");
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция помещает в структуру все данные, отображаемые при печати документа.
// Вызывается из функции ПечатьОприходованияТоваров и из веб-приложения
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьДанныеДляПечатиОприходованияТоваров(ТекущийДокумент)
	
	РежимВыводаКодаВДокументах  = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), 
	ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.РежимВыводаКодаВДокументах"));
	
	ПараметрыПечати = Новый Структура;
	
	ТекстКодАртикул = РежимВыводаКодаВДокументах;
	ПараметрыПечати.Вставить("ВыводитьКоды", Истина);
	ПараметрыПечати.Вставить("ИмяКолонкиКодов", РежимВыводаКодаВДокументах);
	ПараметрыПечати.Вставить("ВыводитьКоличествоМест", Ложь); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номер,
	|	Дата,
	|	Организация,
	|	Склад.Представление КАК Склад,
	|	Основание,
	|	&ВалютаУпрУчета КАК ВалютаДокумента,
	|	Отпустил,
	|	Получил,
	|	Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура." + ТекстКодАртикул + " КАК КодАртикул,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Количество,
	|		ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.уатОприходованиеТоваров КАК ОприходованиеТоваров,
	|	Константы
	|ГДЕ
	|	ОприходованиеТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки
	|";

	мВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	
	Запрос.Параметры.Вставить("ВалютаУпрУчета", мВалютаУпрУчета);
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();

	// Выводим шапку накладной
	ПараметрыПечати.Вставить("ТекстЗаголовка", уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(Шапка, НСтр("en='Taking materials on charge';ru='Оприходование материалов'")));

	ПараметрыПечати.Вставить("ПредставлениеПолучателя", уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
		уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "НаименованиеДляПечатныхФорм,"));
	ПараметрыПечати.Вставить("Получатель"			  , Шапка.Организация);
	ПараметрыПечати.Вставить("ПредставлениеСклада"	  , Шапка.Склад);
	ПараметрыПечати.Вставить("ПредставлениеОснования" , Шапка.Основание);
	ПараметрыПечати.Вставить("Отпустил", уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Шапка.Отпустил));
	ПараметрыПечати.Вставить("Получил",  уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Шапка.Получил));
	
	// Вывести табличную часть
	Позиции = Новый Массив;
	СуммаИтого    = 0;

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		
		ПараметрыПозиции = Новый Структура;
		ПараметрыПозиции.Вставить("Номенклатура"	, ВыборкаСтрокТовары.Номенклатура);		
		
		ПараметрыПозиции.Вставить("НомерСтроки"		, ВыборкаСтрокТовары.НомерСтроки);
		ПараметрыПозиции.Вставить("Товар"			, ВыборкаСтрокТовары.Товар);
		ПараметрыПозиции.Вставить("Количество"		, ВыборкаСтрокТовары.Количество);
		ПараметрыПозиции.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТовары.ЕдиницаИзмерения);
		ПараметрыПозиции.Вставить("Цена"			, ВыборкаСтрокТовары.Цена);
		ПараметрыПозиции.Вставить("Сумма"			, ВыборкаСтрокТовары.Сумма);
		Если ВыборкаСтрокТовары.КодАртикул = "" Тогда
			ПараметрыПозиции.Вставить("КодАртикул", НСтр("en='-';ru='-'"));
		Иначе
			ПараметрыПозиции.Вставить("КодАртикул", ВыборкаСтрокТовары.КодАртикул);
		КонецЕсли;
		
		Позиции.Добавить(ПараметрыПозиции);
		
		СуммаИтого = СуммаИтого + ВыборкаСтрокТовары.Сумма;
	КонецЦикла;
	
	ПараметрыПечати.Вставить("Позиции", Позиции);

	// Вывести Итого
	ПараметрыПечати.Вставить("Всего", уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаИтого));

	// Вывести Сумму прописью
	ПараметрыПечати.Вставить("ИтоговаяСтрока", "Всего наименований " + ВыборкаСтрокТовары.Количество()
	                                       + ", на сумму " + уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаИтого, Шапка.ВалютаДокумента));
	ПараметрыПечати.Вставить("СуммаПрописью", уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(СуммаИтого,  Шапка.ВалютаДокумента));

	Возврат ПараметрыПечати;

КонецФункции //ПолучитьДанныеДляПечатиОприходованияТоваров()

Функция ПечатьНакладная(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОприходованиеТоваров";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОприходованиеТоваров_Накладная";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатОприходованиеТоваров.ПФ_MXL_Накладная");
		
		ПараметрыПечати = ПолучитьДанныеДляПечатиОприходованияТоваров(ТекущийДокумент);
		
		Если ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьШапки  = "ШапкаСКодом";
			ОбластьСтроки = "СтрокаСКодом";
		Иначе
			ОбластьШапки  = "ШапкаТаблицы";
			ОбластьСтроки = "Строка";
		Конецесли;
		
		// Печать штрихкода
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			ОбщийМодульуатЗащищенныеФункцииСервер_проф = ОбщегоНазначения.ОбщийМодуль("уатЗащищенныеФункцииСервер_проф");
			Если ОбщийМодульуатЗащищенныеФункцииСервер_проф.ИспользоватьШтрихкодированиеОбъекта(ТекущийДокумент) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокШтрихкод");
				ОбщийМодульуатЗащищенныеФункцииСервер_проф.ОтобразитьШКнаПФ(ОбластьМакета, ТекущийДокумент);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЕсли;
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывести табличную часть
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ПараметрыПечати.ВыводитьКоды Тогда
			ОбластьМакета.Параметры.Колонка = ПараметрыПечати.ИмяКолонкиКодов;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		
		Для каждого ПараметрыПозиции Из ПараметрыПечати.Позиции Цикл
			
			Если НЕ ЗначениеЗаполнено(ПараметрыПозиции.Номенклатура) Тогда
				ТекстНСТР = НСтр("en='In one of the rows value of products and services not filled - string when printing is missing.';ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.'");
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР,,, СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ОбластьМакета.Параметры.Заполнить(ПараметрыПозиции);
			
			ОбластьМакета.Параметры.Товар = ПараметрыПозиции.Номенклатура;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		// Вывести Итого
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывести подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

#КонецОбласти

#КонецЕсли
